{"job":"Graphic Designer","jobCategory":"Graphics Design","companyName":"OM","email":"OM@world.com","companyWebsite":"www.OM.com","location":"Johannesburg","jobType":"Part Time","jobTags":"web design","salary":"20000","experience":"2 years","jobDescription":"Job Description: Web Designer\n\nA web designer is responsible for creating visually appealing and user-friendly websites. They combine their artistic and technical skills to design and develop websites that meet client requirements and industry standards. Web designers collaborate with clients, project managers, and developers to ensure the successful implementation of design concepts and functionality.\n\nKey Responsibilities:\n1. Design and create visually appealing website layouts, graphics, and user interfaces.\n2. Develop website wireframes, prototypes, and mock-ups to present design concepts to clients.\n3. Collaborate with clients to understand their goals, target audience, and design requirements.\n4. Create responsive designs that adapt to various devices and screen sizes.\n5. Select appropriate colors, typography, and imagery to create a consistent visual style.\n6. Implement web design best practices and optimize websites for performance and search engine optimization (SEO).\n7. Collaborate with developers to ensure seamless integration of design and functionality.\n8. Stay up-to-date with the latest design trends, tools, and technologies.\n9. Conduct usability testing and gather feedback to iterate and improve designs.\n10. Maintain design consistency and standards across multiple pages and sections of a website.\n\nRequired Skills and Qualifications:\n1. Proficiency in graphic design tools such as Adobe Photoshop, Illustrator, or Sketch.\n2. Strong understanding of web design principles, including layout, typography, and color theory.\n3. Knowledge of HTML, CSS, and JavaScript for web design implementation.\n4. Experience with responsive and mobile-first design approaches.\n5. Familiarity with user experience (UX) design principles and usability testing.\n6. Ability to work collaboratively in a team environment and communicate design concepts effectively.\n7. Attention to detail and ability to balance aesthetics with functionality.\n8. Strong problem-solving and critical-thinking skills.\n9. Knowledge of web accessibility standards and practices.\n10. Portfolio showcasing previous web design projects and demonstrating a range of design skills.\n\nPreferred Qualifications:\n1. Experience with front-end development frameworks such as Bootstrap or Foundation.\n2. Familiarity with content management systems (CMS) such as WordPress or Drupal.\n3. Understanding of web analytics and conversion rate optimization (CRO) concepts.\n4. Experience with prototyping tools such as Adobe XD, InVision, or Figma.\n5. Basic knowledge of SEO principles and best practices.\n\nIn summary, a web designer plays a crucial role in creating visually appealing and user-friendly websites. They possess a blend of artistic and technical skills to design and develop websites that meet client expectations and industry standards. Their work greatly influences the user experience and overall success of a website."}